tap "cooklang/tap"
tap "homebrew/bundle"
tap "jakehilborn/jakehilborn"
tap "jonathanruiz/tap"
brew "aichat"
brew "openssl@3"
brew "llvm"
brew "apache-arrow"
brew "ast-grep"
brew "atuin"
brew "bat"
brew "bottom"
brew "gmp"
brew "coreutils"
brew "cowsay"
brew "dust"
brew "eza"
brew "f2"
brew "fastfetch"
brew "fd"
brew "ffmpeg"
brew "figlet"
brew "fish"
brew "fzf"
brew "gh"
brew "git-delta"
brew "gnupg"
brew "graphviz"
brew "htop"
brew "hyperfine"
brew "libomp", link: true
brew "imagemagick"
brew "just"
brew "k9s"
brew "kubernetes-cli"
brew "lazydocker"
brew "lazygit"
brew "mas"
brew "mise"
brew "neovim"
brew "p7zip"
brew "pandoc"
brew "poppler"
brew "procs"
brew "qpdf"
brew "ripgrep"
brew "rsync"
brew "rustup"
brew "sd"
brew "starship"
brew "tealdeer"
brew "terraform"
brew "tokei"
brew "topgrade"
brew "typos-cli"
brew "typst"
brew "typstyle"
brew "uv"
brew "watchexec"
brew "wget"
brew "xan"
brew "yamlfmt"
brew "yazi"
brew "yj"
brew "yq"
brew "yt-dlp"
brew "zellij"
brew "zlib"
brew "zoxide"
brew "jakehilborn/jakehilborn/displayplacer"
cask "1password"
cask "1password-cli"
cask "arc"
cask "citrix-workspace"
cask "docker-desktop"
cask "font-fira-code"
cask "font-fira-code-nerd-font"
cask "font-fontawesome"
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"
cask "font-sf-mono"
cask "font-sf-pro"
cask "ghostty"
cask "gitkraken"
cask "gitkraken-cli"
cask "google-chrome"
cask "karabiner-elements"
cask "moneymoney"
cask "ngrok"
cask "notion"
cask "obsidian"
cask "pdf-expert"
cask "raycast"
cask "skim"
cask "spotify"
cask "telegram"
cask "visual-studio-code"
cask "whatsapp"
cask "zed"
cask "zotero"
mas "Amphetamine", id: 937984704
mas "AusweisApp", id: 948660805
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Reeder", id: 1529448980
vscode "bmalehorn.vscode-fish"
vscode "bradlc.vscode-tailwindcss"
vscode "charliermarsh.ruff"
vscode "docker.docker"
vscode "eamodio.gitlens"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-pull-request-github"
vscode "hashicorp.terraform"
vscode "ms-azuretools.vscode-containers"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "myriad-dreamin.tinymist"
vscode "nefrob.vscode-just-syntax"
vscode "oxc.oxc-vscode"
vscode "redhat.vscode-yaml"
vscode "tamasfe.even-better-toml"
vscode "tekumara.typos-vscode"
vscode "usernamehw.errorlens"
vscode "vscodevim.vim"
vscode "vspacecode.vspacecode"
vscode "vspacecode.whichkey"
vscode "yzhang.markdown-all-in-one"
