brew "aichat"
brew "openssl@3"
brew "llvm"
brew "apache-arrow"
brew "atuin"
brew "bat"
brew "bottom"
brew "carapace"
brew "gmp"
brew "coreutils"
brew "cowsay"
brew "dust"
brew "eza"
brew "f2"
brew "fastfetch"
brew "fd"
brew "ffmpeg"
brew "figlet"
brew "fish"
brew "fzf"
brew "gh"
brew "ghostscript"
brew "git-delta"
brew "gnupg"
brew "graphviz"
brew "htop"
brew "httpd"
brew "hyperfine"
brew "imagemagick"
brew "just"
brew "libomp"
brew "mas"
brew "mise"
brew "neovim"
brew "p7zip"
brew "pandoc"
brew "poppler"
brew "procs"
brew "ripgrep"
brew "rsync"
brew "sd"
brew "starship"
brew "tokei"
brew "topgrade"
brew "typos-cli"
brew "typst"
brew "watchexec"
brew "wget"
brew "yazi"
brew "yq"
brew "yt-dlp"
brew "zlib"
brew "zoxide"
cask "1password"
cask "1password-cli"
cask "arc"
cask "citrix-workspace"
cask "codex"
cask "codex-app"
cask "docker-desktop"
cask "font-fira-code-nerd-font"
cask "font-fontawesome"
cask "font-jetbrains-mono-nerd-font"
cask "font-sf-mono"
cask "font-sf-pro"
cask "ghostty"
cask "gitkraken"
cask "gitkraken-cli"
cask "google-chrome"
cask "karabiner-elements"
cask "moneymoney"
cask "raycast"
cask "skim"
cask "visual-studio-code"
cask "whatsapp"
mas "Amphetamine", id: 937984704
mas "Keynote", id: 361285480
mas "Numbers", id: 409203825
mas "Pages", id: 361309726
mas "Reeder", id: 1529448980
vscode "bmalehorn.vscode-fish"
vscode "bodil.file-browser"
vscode "bradlc.vscode-tailwindcss"
vscode "charliermarsh.ruff"
vscode "eamodio.gitlens"
vscode "github.copilot-chat"
vscode "jacobdufault.fuzzy-search"
vscode "kahole.magit"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "myriad-dreamin.tinymist"
vscode "nefrob.vscode-just-syntax"
vscode "oxc.oxc-vscode"
vscode "redhat.vscode-yaml"
vscode "tamasfe.even-better-toml"
vscode "tekumara.typos-vscode"
vscode "unifiedjs.vscode-mdx"
vscode "usernamehw.errorlens"
vscode "vscodevim.vim"
vscode "vspacecode.vspacecode"
vscode "vspacecode.whichkey"
vscode "yzhang.markdown-all-in-one"
