tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "jakehilborn/jakehilborn"
brew "aichat"
brew "llvm"
brew "apache-arrow"
brew "ast-grep"
brew "atuin"
brew "bat"
brew "bottom"
brew "commitizen"
brew "coreutils"
brew "cowsay"
brew "difftastic"
brew "eza"
brew "fd"
brew "ffmpeg"
brew "figlet"
brew "fish"
brew "fzf"
brew "gh"
brew "git-delta"
brew "gnupg"
brew "graphviz"
brew "htop"
brew "hyperfine"
brew "libomp", link: true
brew "imagemagick"
brew "jinja2-cli"
brew "k9s"
brew "kubernetes-cli"
brew "lazydocker"
brew "lazygit"
brew "mas"
brew "maturin"
brew "mise"
brew "neofetch"
brew "neovim"
brew "pandoc"
brew "pdm"
brew "pipx"
brew "poetry"
brew "poppler"
brew "pre-commit"
brew "ripgrep"
brew "rsync"
brew "rustup"
brew "rye"
brew "starship"
brew "tmux"
brew "uv"
brew "wget"
brew "yazi"
brew "yq"
brew "yt-dlp"
brew "zlib"
brew "zoxide"
brew "jakehilborn/jakehilborn/displayplacer"
cask "1password"
cask "1password-cli"
cask "alacritty"
cask "arc"
cask "canva"
cask "cursor"
cask "docker"
cask "drawio"
cask "font-fira-code-nerd-font"
cask "font-sf-mono"
cask "gitkraken"
cask "gitkraken-cli"
cask "little-snitch"
cask "mactex"
cask "moneymoney"
cask "notion"
cask "postman"
cask "raycast"
cask "skim"
cask "slack"
cask "spotify"
cask "telegram"
cask "visual-studio-code"
cask "whatsapp"
cask "zed"
cask "zoom"
cask "zotero"
mas "1Password for Safari", id: 1569813296
mas "Amphetamine", id: 937984704
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Reeder", id: 1529448980
vscode "charliermarsh.ruff"
vscode "christian-kohler.path-intellisense"
vscode "eamodio.gitlens"
vscode "foxundermoon.shell-format"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "jacobdufault.fuzzy-search"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.remote-explorer"
vscode "njpwerner.autodocstring"
vscode "redhat.vscode-yaml"
vscode "rust-lang.rust-analyzer"
vscode "tamasfe.even-better-toml"
vscode "tekumara.typos-vscode"
vscode "timonwong.shellcheck"
vscode "usernamehw.errorlens"
vscode "vadimcn.vscode-lldb"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscodevim.vim"
vscode "vspacecode.vspacecode"
vscode "vspacecode.whichkey"
vscode "yzhang.markdown-all-in-one"
